src/cf/Catalogs/CRM_ТочкиМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ТочкиМаршрутов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CRM_КартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Групповая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>Порядковый номер точки в карте маршрута</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВариантыЗавершенияБизнесПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОбработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогШаблоныОбработчиковБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогТипЗадачиИсполнителя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогТипЗадачиИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбработчикиСобытий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ОбработчикиСобытийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонОбработчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогШаблоныОбработчиковБизнесПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиРазделенияСлияния</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ВидыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыТочкиМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр1</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр2</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр3</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр4</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр5</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогШаблоныСтатусов</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
								<v8:Type>cfg:EnumRef.вогСтатусыДоговоровКоммерческихСоглашений</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.вогВопросы</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.вогВариантыОпросов</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_Классификаторы</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РедактируемыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъекту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКРеквизиту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписыватьВРежимеОбменДанными</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработчикПриЗаполнении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_ВидыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВидыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_ТочкиМаршрутов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Групповая.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие);
	Элементы.Пояснение.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие);
	
	Элементы.ВложенныйПроцесс.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс);
	Элементы.ВходящиеТочки.Видимость = (Объект.Вид <> Перечисления.CRM_ВидыТочекМаршрута.Старт);
	Элементы.ИсходящиеТочки.Видимость = (Объект.Вид <> Перечисления.CRM_ВидыТочекМаршрута.Завершение);
	Элементы.ВариантЗавершения.Видимость = (Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.Завершение);
	
	ЗаполнитьАдресаКартинокКоманд();
	
	// ++ Тищенко В.В. 29.03.2019
	// Видимость тип задачи
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"вогТипЗадачиИсполнителя","Видимость",Объект.Вид = Перечисления.CRM_ВидыТочекМаршрута.Действие);
	// -- Тищенко В.В. 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиСобытийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ТекстОбработки,Заголовок,ШаблонОбработчика", Элемент.ТекущиеДанные.Обработчик,"Обработчик события "+""""+Строка(Элемент.ТекущиеДанные.Событие)+""""
	,Элемент.ТекущиеДанные.ШаблонОбработчика);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикиСобытийВыборЗавершение", ЭтотОбъект, Элемент);
	ОткрытьФорму("Справочник.CRM_ТочкиМаршрутов.Форма.ФормаРедактированияТекста", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикиСобытийВыборЗавершение(Результат, Элемент) экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Элемент.ТекущиеДанные.Обработчик 		= Результат.Обработчик;
		Элемент.ТекущиеДанные.ШаблонОбработчика = Результат.ШаблонОбработчика;
	КонецЕсли;
	
КонецПроцедуры

// ++ Харченко Д.И. №  - 01.11.2018 / 


&НаКлиенте
Процедура КомандыТочкиМаршрутаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КомандыТочкиМаршрутаОбработчик" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормыОткрытия = Новый Структура("ТекстОбработки, Заголовок", Элемент.ТекущиеДанные.Обработчик, "Обработчик команды "+""""+Строка(Элемент.ТекущиеДанные.Команда)+"""");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("КомандыВопросаВыборЗавершение", ЭтотОбъект, Элемент);
		
		ОткрытьФорму("Справочник.CRM_ТочкиМаршрутов.Форма.ФормаРедактированияТекста", ПараметрыФормыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
		
	ИначеЕсли Поле.Имя = "КомандыТочкиМаршрутаИмяКартинки" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Описание = Новый ОписаниеОповещения("ОписаниеОповещенияВыборКартинкиИзСписка", ЭтотОбъект, Элементы.КомандыТочкиМаршрута.ТекущаяСтрока);
		
		СписокКартинок = ПолучитьСписокВыбораКартинок();
		
		ТекДанные = Объект.КомандыТочкиМаршрута.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		ТекЭлемент = Неопределено;
		
		Если ЗначениеЗаполнено(ТекДанные.ИмяКартинки) Тогда
			ТекЭлемент = СписокКартинок.НайтиПоЗначению(ТекДанные.ИмяКартинки);
		КонецЕсли;
		
		ПоказатьВыборИзСписка(Описание, СписокКартинок, , ТекЭлемент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыВопросаВыборЗавершение(Результат, Элемент) Экспорт
	
	Если Не Результат = Неопределено Тогда
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Результат.Свойство("Обработчик", Элемент.ТекущиеДанные.Обработчик);
		Иначе 
			Элемент.ТекущиеДанные.Обработчик = Результат;
		КонецЕсли;		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // КомандыВопросаВыборЗавершение()

&НаКлиенте
Процедура ОписаниеОповещенияВыборКартинкиИзСписка(Значение, ИДСтроки) Экспорт 
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоискСтроки = Объект.КомандыТочкиМаршрута.НайтиПоИдентификатору(ИДСтроки);
	
	Если ПоискСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоискСтроки.ИмяКартинки = Значение.Значение;
	
	ЗаполнитьАдресКартинки(ИДСтроки);
	
	Модифицированность = Истина;
	
КонецПроцедуры // ОписаниеОтветаНаВопросГиперссылки()

Процедура ЗаполнитьАдресаКартинокКоманд()
	
	Для Каждого стр Из Объект.КомандыТочкиМаршрута Цикл 
		
		ЗаполнитьАдресКартинки(стр.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьАдресКартинки(ИДСтроки)
	
	ПоискСтроки = Объект.КомандыТочкиМаршрута.НайтиПоИдентификатору(ИДСтроки);
	
	Если ПоискСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоискСтроки.ИмяКартинки) Тогда
		ПоискСтроки.Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок[ПоискСтроки.ИмяКартинки], ЭтаФорма.УникальныйИдентификатор);
	Иначе 
		ПоискСтроки.Картинка = "Нет";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокВыбораКартинок()
	
	Возврат вогУправлениеОпросамиСервер.ПолучитьСписокВыбораКартинок();
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьАдресаКартинокКоманд();
	
КонецПроцедуры

// ++ VOG Солодов В.В. 30.04.2020 CRM-601
&НаКлиенте
Процедура РедактируемыРеквизитыОбработчикПриЗаполненииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РедактируемыРеквизиты.ТекущиеДанные;
	
	ПараметрыФормыОткрытия = Новый Структура();
	ПараметрыФормыОткрытия.Вставить("ТекстОбработки", 	ТекущиеДанные.ОбработчикПриЗаполнении);
	ПараметрыФормыОткрытия.Вставить("Заголовок", 		Элемент.Заголовок);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"РедактируемыРеквизитыОбработчикПриЗаполненииНачалоВыбораЗавершение",
		ЭтотОбъект,
		ТекущиеДанные);
	
	ОткрытьФорму(
		"Справочник.CRM_ТочкиМаршрутов.Форма.ФормаРедактированияТекста",
		ПараметрыФормыОткрытия,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыРеквизитыОбработчикПриЗаполненииНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Результат.Свойство("Обработчик", ДополнительныеПараметры.ОбработчикПриЗаполнении);
	Иначе 
		ДополнительныеПараметры.ОбработчикПриЗаполнении = Результат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры
// -- VOG Солодов В.В. 30.04.2020
